src/test/resources/plays/invoices/get.yaml

!play
interactions:
-
  request:
    uri: /v2/invoices/INV-CA56C3217FA8
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: GET
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"INV-CA56C3217FA8","amount":{"total":1000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":1000}},"items":[{"product":"My Invoice Product","detail":"My Invoice Detail","price":1000}],"customer":{"email":"vavagner.vieira@moip.com.br"},"receivers":[{"moipAccount":{"id":"MPA-CULBBYHD11","fullname":"Jose Silva dos Santos","company":{"name":null}}}],"status":"DELIVERED","createdAt":"2017-04-05T14:44:11.000-00","updatedAt":"2017-04-05T14:44:12.000-00","_links":{"self":{"href":"/invoice/INV-CA56C3217FA8"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-CA56C3217FA8\u0026token=e643bc92-652d-4898-8f67-815faa821e36"}}}}