src/test/resources/plays/invoices/list.yaml

!play
interactions:
-
  request:
    uri: /v2/invoices
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: GET
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"_links":{"next":{"href":"/invoices?limit=20\u0026offset=20"},"previous":{"href":"/invoices/?limit=20\u0026offset=0"}},"summary":{"count":3},"invoices":[{"id":"INV-CA56C3217FA8","amount":{"total":1000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":1000}},"items":[{"product":"My Invoice Product","detail":"My Invoice Detail","price":1000}],"customer":{"email":"vavagner.vieira@moip.com.br"},"status":"DELIVERED","createdAt":"2017-04-05T14:44:11.000-00","updatedAt":"2017-04-05T14:44:12.000-00","_links":{"self":{"href":"/invoice/INV-CA56C3217FA8"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-CA56C3217FA8\u0026token=e643bc92-652d-4898-8f67-815faa821e36"}}}},{"id":"INV-B36128A22351","amount":{"total":1000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":1000}},"items":[{"product":"My Invoice Product","detail":"My Invoice Detail","price":1000}],"customer":{"email":"vavagner.vieira@moip.com.br"},"status":"DELIVERED","createdAt":"2017-04-05T14:43:36.000-00","updatedAt":"2017-04-05T14:43:36.000-00","_links":{"self":{"href":"/invoice/INV-B36128A22351"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-B36128A22351\u0026token=efbd1ec2-5915-48c8-9533-ebed1f4af133"}}}},{"id":"INV-5B6ECCBAEAA6","amount":{"total":1000,"fees":0,"refunds":0,"liquid":0,"otherReceivers":0,"currency":"BRL","subtotals":{"shipping":0,"addition":0,"discount":0,"items":1000}},"items":[{"product":"Produto","detail":"Detalhe","price":1000}],"customer":{"email":"vavagner.vieira@moip.com.br"},"status":"DELIVERED","createdAt":"2017-04-05T14:43:24.000-00","updatedAt":"2017-04-05T14:43:24.000-00","_links":{"self":{"href":"/invoice/INV-5B6ECCBAEAA6"},"checkout":{"pay":{"redirectHref":"https://checkout-new-sandbox.moip.com.br?id=INV-5B6ECCBAEAA6\u0026token=e876c395-e454-4a2a-ac86-5bddeb51e8f5"}}}}]}